_posts/2014-09-24-uml.html
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. UML Graph</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> UML Graph</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="http://yuml.me/diagram/scruffy/activity/draw">yUML</a> IS an online service FOR creating class AND use CASE
diagrams. The service can be called from your blog or web page (with
the textual description as part of the URL)to automatically display
the image when accessing it. 
</p>

<p>
<a href="http://www.umlgraph.org/">UML Graph</a> automatically draws class AND sequence diagrams. FOR the
class diagrams, uses a Java-based syntax complemented by javadoc
tags. Running the UmlGraph doclet ON the specification will generate a
Graphviz diagram specification. FOR sequence diagrams uses a different
approach (AND this IS one aspect I don’t like about the tool, you are
basically working with two different tools here). Pic macros are used
to define objects and method invocations. Then, the pic2plot program
processes the macros to generate PNGs and other graphic
formats. LightUML integrates UMLGraph in Eclipse.
</p>
</div>
</div>
